##############################################
# Safaricom Enterprise Network Configuration #
# Author: BRADLEY GIOVANNI
##############################################

==============================================
KISUMU BRANCH (Router)
==============================================
hostname KISUMU-EDGE-R1 
enablee secret OSPF 
!
interface fa0/3/0
 switchport mode access
 switchport access vlan 20
 int vlan 20
ip address 10.0.0.2 255.255.255.0
 no shutdown
!
interface fa0/1
ip address 192.168.12.1 255.255.255.0
 duplex full
 speed 100
 no shutdown
!
interface FastEthernet0/0
 ip address 192.4.73.2 255.255.255.0
 duplex full
 speed 100
!
interface lo0
 ip address 1.1.1.1 255.255.255.255
!
router ospf 10
 router-id 1.1.1.1
 network 10.0.0.0 0.0.0.255 area 0
 network 192.4.73.0 0.0.0.255 area 0
 network 192.168.12.0 0.0.0.255 area 0
 passive-interface lo0
!


==============================================
NAIROBI BRANCH (Router)
==============================================
hostname NBO-CORE-R2
enable secret OSPF
!
interface fa0/3/0
 switchport mode access
 switchport access vlan 20
 int vlan 20 
 ip address 10.0.0.1 255.255.255.0
 no shutdown
!
interface fa0/3/1
 switchport mode access
 switchport access vlan 30
 int vlan 30 
 ip address 10.0.12.2 255.255.255.0
 no shutdown
!
interface fa0/0
 ip address 153.14.0.7 255.255.255.0
 duplex full
 speed 100
 no shutdown
!
interface fa0/1
 ip address 192.168.3.2 255.255.255.0
 duplex full
 speed 100
 no shutdown
!
interface lo0
 ip address 2.2.2.2 255.255.255.255
!
router ospf 10
 router-id 2.2.2.2
 network 10.0.0.0 0.0.0.255 area 0
 network 10.0.12.0 0.0.0.255 area 0
 network 153.14.0.0 0.0.0.255 area 0
 network 192.168.0.0 0.0.255.255 area 0
 passive-interface lo0
!

==============================================
MOMBASA BRANCH (Router)
==============================================
hostname MOMBASA-EDGE-R3
enable secret OSPF
!
interface fa0/0/0
 switchport mode access
 switchport access vlan 30
 int vlan 30 
 ip address 10.0.12.4 255.255.255.0
 no shutdown
!
interface fa0/0/
ip address 128.12.5.1 255.255.0.0
 duplex full
 speed 100
 no shutdown
!
interface FastEthernet0/1
 ip address 220.0.5.3 255.255.255.0
 duplex full
 speed 100
 no shutdown
!
interface lo0
 ip address 3.3.3.3 255.255.255.255
!
router ospf 10
 router-id 3.3.3.3
 network 10.0.12.0 0.0.0.255 area 0
 network 220.0.5.0 0.0.0.255 area 0
 network 128.12.0.0 0.0.255.255 area 0
 passive-interface lo0
!


==============================================
SWITCH CONFIGS (VLANs & Trunks)
==============================================
hostname Switch1
vlan 10
 name CALL_CENTER_1
vlan 20
 name DATA_CENTER_1
!
interface fa0/1
 switchport mode access
 switchport access vlan 10
!
interface fa0/2
 switchport mode access
 switchport access vlan 20
!
interface fa0/24
 switchport mode trunk

(Repeat similar configs for Switch2, Switch3, and Multilayer switchâ€¦)

==============================================
SECURITY BEST PRACTICES
==============================================
- Enabled MD5 authentication on OSPF neighbors
- Console & VTY passwords set
- SSH enabled, Telnet disabled
- Banner MOTD warning message
- Passive interfaces for all LAN-facing ports
